app/views/asign_departament_users/_form.html.erb

SELECT "users".* FROM "users"
---
        <div class="col-sm-10">
        <%= form.collection_select(:user_id, User.all, :id, :first_name, {:prompt => 'Seleccionar usuario', :selected => @asign_departament_user.user_id},{:class =>'form-control'}) %>

SELECT "departaments".* FROM "departaments"
---
        <div class="col-sm-10">
        <%= form.collection_select(:departament_id, Departament.all, :id, :name, {:prompt => 'Seleccionar departamento', :selected => @asign_departament_user.departament_id},{:class =>'form-control'}) %>

SELECT "companies".* FROM "companies"
---
        <div class="col-sm-10">
        <%= form.collection_select(:company_id, Company.all, :id, :name, {:prompt => 'Seleccionar empresa', :selected => @asign_departament_user.company_id},{:class =>'form-control'}) %>