app/views/asign_departament_users/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
      <tr>
        <td><%= asign_departament_user.user.first_name %> <%= asign_departament_user.user.last_name %></td>