app/views/departaments/_form.html.erb

SELECT "corporations".* FROM "corporations"
---
        <div class="col-sm-10">
        <%= form.collection_select(:corporation_id, Corporation.all, :id, :name, {:prompt => 'Seleccionar una corporation', :selected => @departament.corporation_id},{:class =>'form-control'}) %>