app/views/asign_team_user_categories/_form.html.erb

SELECT "users".* FROM "users"
---
        <div class="col-sm-10">
        <%= form.collection_select(:user_id, User.all, :id, :first_name, {:prompt => 'Seleccionar usuario', :selected => @asign_team_user_category.user_id},{:class =>'form-control'}) %>

SELECT "categories".* FROM "categories"
---
        <div class="col-sm-10">
        <%= form.collection_select(:category_id, Category.all, :id, :name, {:prompt => 'Seleccionar categoria', :selected => @asign_team_user_category.category_id},{:class =>'form-control'}) %>

SELECT "teams".* FROM "teams"
---
        <div class="col-sm-10">
        <%= form.collection_select(:team_id, Team.all, :id, :name, {:prompt => 'Seleccionar equipo', :selected => @asign_team_user_category.team_id},{:class =>'form-control'}) %>