app/views/asign_team_user_categories/index.html.erb

      <tr>
        <td><%= asign_team_user_category.user.first_name %> <%= asign_team_user_category.user.last_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]