app/views/tickets/_form.html.erb

    <div class="col-sm-10">
      <%= form.collection_select(:category_id, Category.all, :id, :name, {:prompt => 'Seleccionar una categoria', :selected => @ticket.category_id},{:class =>'form-control'}) %>
---
SELECT "categories".* FROM "categories"