app/views/tickets/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---

                         <td><%= ticket.user.first_name %> <%= ticket.user.last_name%></td>