app/views/tickets/show.html.erb


           <%= @ticket.user.first_name %> <%= @ticket.user.last_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]