app/views/companies/_form.html.erb

        <div class="col-sm-10">
        <%= form.collection_select(:corporation_id, Corporation.all, :id, :name, {:prompt => 'Seleccionar una coporation', :selected => @company.corporation_id},{:class =>'form-control'}) %>
---
SELECT "corporations".* FROM "corporations"