app/views/users_roles/_form.html.erb

        <div class="col-sm-10">
        <%= form.collection_select(:user_id, User.all, :id, :first_name, {:prompt => 'Seleccionar usuario', :selected => @users_role.user_id},{:class =>'form-control'}) %>
---
SELECT "users".* FROM "users"

        <div class="col-sm-10">
        <%= form.collection_select(:role_id, Role.all, :id, :name, {:prompt => 'Seleccionar role', :selected => @users_role.role_id},{:class =>'form-control'}) %>
---
SELECT "roles".* FROM "roles"