app/views/users_roles/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <tr>
        <td><%= users_role.user.first_name %> <%= users_role.user.last_name %></td>