app/controllers/asginar_tickets_controller.rb

  def tomar
    @usuario = params[:user_id]
    @ticket = params[:ticket_id]

    a =  AsginarTicket.new
    a.user_id = @usuario
    a.ticket_id = @ticket

    u = Ticket.find_by("id = ?", @ticket)
    u.estado = 1
    u.save



      if a.save
---
SELECT  "tickets".* FROM "tickets" WHERE (id = '5') LIMIT $1  [["LIMIT", 1]]
UPDATE "tickets" SET "estado" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["estado", 1], ["updated_at", "2018-04-26 18:41:01.689576"], ["id", 5]]
INSERT INTO "asginar_tickets" ("user_id", "ticket_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["ticket_id", 5], ["created_at", "2018-04-26 18:41:01.700235"], ["updated_at", "2018-04-26 18:41:01.700235"]]