app/controllers/asign_team_user_categories_controller.rb

SELECT "asign_team_user_categories".* FROM "asign_team_user_categories"
---
  def index
    @asign_team_user_categories = AsignTeamUserCategory.all

INSERT INTO "asign_team_user_categories" ("user_id", "category_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["category_id", 1], ["team_id", 1], ["created_at", "2018-04-26 00:10:55.750120"], ["updated_at", "2018-04-26 00:10:55.750120"]]
---
  def create
    @asign_team_user_category = AsignTeamUserCategory.new(asign_team_user_category_params)

    respond_to do |format|
      if @asign_team_user_category.save

SELECT  "asign_team_user_categories".* FROM "asign_team_user_categories" WHERE "asign_team_user_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_asign_team_user_category
      @asign_team_user_category = AsignTeamUserCategory.find(params[:id])