app/controllers/asign_departament_users_controller.rb

  def index
    @asign_departament_users = AsignDepartamentUser.all
---
SELECT "asign_departament_users".* FROM "asign_departament_users"

  def create
    @asign_departament_user = AsignDepartamentUser.new(asign_departament_user_params)

    respond_to do |format|
      if @asign_departament_user.save
---
INSERT INTO "asign_departament_users" ("user_id", "departament_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 7], ["departament_id", 7], ["company_id", 5], ["created_at", "2018-04-25 23:51:43.200664"], ["updated_at", "2018-04-25 23:51:43.200664"]]

    def set_asign_departament_user
      @asign_departament_user = AsignDepartamentUser.find(params[:id])
---
SELECT  "asign_departament_users".* FROM "asign_departament_users" WHERE "asign_departament_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]