app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dsfasd"], ["description", "adfsdfasdfas"], ["created_at", "2018-04-24 00:07:10.831667"], ["updated_at", "2018-04-24 00:07:10.831667"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "categories"."id" = $4  [["name", "Soporte Técnico"], ["description", "Soporte Técnico"], ["updated_at", "2018-04-24 00:07:34.215718"], ["id", 3]]