app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "description", "social_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Integro S.A."], ["description", ""], ["social_name", ""], ["created_at", "2018-04-20 00:34:10.068333"], ["updated_at", "2018-04-20 00:34:10.068333"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save