app/controllers/companias_controller.rb

SELECT "compania".* FROM "compania"
---
  def index
    @companias = Compania.all