app/controllers/corporations_controller.rb

SELECT "corporations".* FROM "corporations"
---
  def index
    @corporations = Corporation.all

INSERT INTO "corporations" ("name", "description", "phone", "social_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @corporation = Corporation.new(corporation_params)

    respond_to do |format|
      if @corporation.save

SELECT  "corporations".* FROM "corporations" WHERE "corporations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_corporation
      @corporation = Corporation.find(params[:id])