app/controllers/dashboard_controller.rb

  def dashboard
    # Lista todos los tickets nuevos



    @usuario = User.find(current_user.id)
    @acceso = @usuario.roles.first.name
    if @acceso == "usuario" then redirect_to new_ticket_path end


    @usuario = User.find(current_user.id)


    @TicketsNuevos = Ticket.where("estado = ?",0)
    @TicketsNuevos = @TicketsNuevos.count
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 9], ["LIMIT", 1]]
SELECT  "tickets".* FROM "tickets" WHERE (estado = 'abierto') LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "tickets" WHERE (estado = 0)

  def dashboard_v1
      @usuario = User.find(current_user.id)
      @acceso = @usuario.roles.first.name
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 9], ["LIMIT", 1]]