app/controllers/departaments_controller.rb

  def index
    @departaments = Departament.all
---
SELECT "departaments".* FROM "departaments"

  def create
    @departament = Departament.new(departament_params)

    respond_to do |format|
      if @departament.save
---
INSERT INTO "departaments" ("name", "created_at", "updated_at", "corporation_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Finanzas"], ["created_at", "2018-04-21 00:10:32.488665"], ["updated_at", "2018-04-21 00:10:32.488665"], ["corporation_id", 1]]

  def update
    respond_to do |format|
      if @departament.update(departament_params)
---
UPDATE "departaments" SET "name" = $1, "updated_at" = $2 WHERE "departaments"."id" = $3  [["name", "FINANZAS"], ["updated_at", "2018-04-23 22:38:03.195205"], ["id", 1]]

    def set_departament
      @departament = Departament.find(params[:id])
---
SELECT  "departaments".* FROM "departaments" WHERE "departaments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]