app/controllers/roles_controller.rb

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cliente"], ["created_at", "2018-04-26 15:05:45.760169"], ["updated_at", "2018-04-26 15:05:45.760169"]]

  def update
    respond_to do |format|
      if @role.update(role_params)
---
UPDATE "roles" SET "name" = $1, "updated_at" = $2 WHERE "roles"."id" = $3  [["name", "cliente"], ["updated_at", "2018-04-26 15:06:46.307417"], ["id", 3]]