app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save