app/controllers/tickets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE (categoria_id in (4)) ORDER BY "tickets"."id" DESC
SELECT  "asign_team_user_categories"."category_id" FROM "asign_team_user_categories" WHERE (user_id = 5) LIMIT $1  [["LIMIT", 1]]
SELECT  "asign_team_user_categories".* FROM "asign_team_user_categories" WHERE (user_id = 8) LIMIT $1  [["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tickets".* FROM "tickets" WHERE (category_id in (2)) ORDER BY "tickets"."id" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tickets"
---
  def index
      x = User.find(current_user.id)

    if current_user.has_role? :admin  then

      @tickets = Ticket.order(id: :desc).all

    else

      @Acate = AsignTeamUserCategory.select("category_id").find_by("user_id = ?",current_user.id)

      if @Acate.blank? then
          @tickets = Ticket.where("user_id = ?",current_user.id).order(id: :desc)
      else

          @tickets = Ticket.where("category_id in (?)", @Acate.category_id).order(id: :desc)

      end

    #abort current_user.id.inspect
    end

    @tickets = @tickets.paginate(:page => params[:page])

SELECT "ticket_detalles".* FROM "ticket_detalles" WHERE (ticket_id = '4')
---
  def show


    @ticket_detalles = TicketDetalle.where("ticket_id = ?",params[:id])

SELECT  "tickets".* FROM "tickets" WHERE (id = '5') LIMIT $1  [["LIMIT", 1]]
UPDATE "tickets" SET "estado" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["estado", 4], ["updated_at", "2018-04-26 18:48:35.977187"], ["id", 5]]
---
  def cerrar
    @usuario = params[:user_id]
    @ticket = params[:ticket_id]


    u = Ticket.find_by("id = ?", @ticket)
    u.estado = 4
    u.updated_at = Time.now

INSERT INTO "tickets" ("user_id", "asunto", "descripcion", "estado", "created_at", "updated_at", "prioridad", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save