app/controllers/ticket_detalles_controller.rb

INSERT INTO "ticket_detalles" ("user_id", "ticket_id", "mensaje", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["ticket_id", 5], ["mensaje", "se cargaron las plantillas revisar y confirmar"], ["created_at", "2018-04-26 18:42:19.778244"], ["updated_at", "2018-04-26 18:42:19.778244"]]
---
  def create


    @ticket_detalle = TicketDetalle.new(ticket_detalle_params)

    respond_to do |format|
      if @ticket_detalle.save