app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    #abort @user.inspect
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "last_name" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["last_name", "Rosalesv"], ["encrypted_password", "$2a$11$32o.ZvuMdDDcr5bO5Ag/nePzTobtlP3uG3VkUHX3gezn1HJgJS2yi"], ["updated_at", "2018-04-24 18:57:37.468860"], ["id", 1]]