app/controllers/users_roles_controller.rb

SELECT "users_roles".* FROM "users_roles"
---
  def index
    @users_roles = UsersRole.all

INSERT INTO "users_roles" ("user_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 9], ["role_id", 6], ["created_at", "2018-04-27 00:05:45.730822"], ["updated_at", "2018-04-27 00:05:45.730822"]]
---
  def create
    @users_role = UsersRole.new(users_role_params)

    respond_to do |format|
      if @users_role.save

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users_roles".* FROM "users_roles" WHERE "users_roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_users_role
      @users_role = UsersRole.find(params[:id])