app/views/layouts/partials/_sidebar.html.erb

SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 10], ["LIMIT", 1]]
---
         <!-- /Layouts -->
<% if  current_user.roles.first.name == "admin" then  %>